ITEM_CATEGORY_RULES = {

    "식비": [
        # 한식
        "김밥","국밥","비빔밥","덮밥","제육볶음","닭갈비","갈비탕","설렁탕","삼계탕",
        "냉면","비빔냉면","물냉면","칼국수","쫄면","우동","라멘","짜장면","짬뽕",
        "탕수육","팔보채","양장피","마라탕","마라샹궈","훠궈","딤섬","만두",
        "떡볶이","순대","오뎅","튀김","핫도그","치즈볼","족발","보쌈","삼겹살",
        "갈비","곱창","막창","회","초밥","롤","사시미","회덮밥","매운탕",
        "해장국","된장찌개","김치찌개","순두부찌개","조기탕","오므라이스",
        "볶음","튀김","조림","구이","찜","꼬치","사테","렌당","비리야니",
        "나시고랭","미고랭","푸팟퐁커리","똠양꿍","월남쌈","분짜","반미",
        "타코","브리또","케밥","샤와르마",

        # 간편식
        "샌드위치","치아바타","파니니","토스트","브런치","샐러드","샐러드볼",
        "스프","크림스프","단호박스프","수프","베이글","와플","케이크","케잌",
        "브라우니","마카롱","도넛","쿠키","머핀","파이","크로와상","빵",
        "버거","햄버거","치즈버거","새우버거","치킨버거","포케","도시락","세트","콤보","플레이트",

        # 음료
        "아메리카노","카페라떼","라떼","카푸치노","콜드브루","에스프레소",
        "모카","마끼아또","프라푸치노","스무디","밀크티","에이드","주스",
        "딸기주스","망고주스","케일주스","바나나주스","요거트","요거트스무디",

        # 식재료
        "쌀","밀가루","설탕","소금","식용유","참기름","간장","고추장","된장",
        "고춧가루","카레가루","후추","마늘","양파","감자","당근","호박","가지","버섯","콩","두부","계란",
        "소고기","돼지고기","닭고기","양고기","해산물","생선","새우","오징어","조개",
        "김","미역","다시마","톳","파래","김치","반찬","젓갈","장아찌", "매밀",
        "즉석", 
    ],


    "쇼핑": [
        # 의류
        "티셔츠","셔츠","블라우스","맨투맨","후드","후디","니트","가디건",
        "자켓","재킷","코트","패딩","점퍼","원피스","드레스","스커트",
        "치마","바지","슬랙스","청바지","데님","조거","레깅스","반바지",
        "양말","신발","스니커즈","운동화","부츠","샌들","가방","백팩",

        # 패션
        "모자","벨트","지갑","시계","주얼리","목걸이","반지","팔찌",
        "선글라스","안경",

        # 전자제품
        "휴대폰","스마트폰","노트북","태블릿","이어폰","헤드폰",
        "모니터","키보드","마우스","프린터","카메라","TV",

        # 생활용품
        "가구","의자","책상","소파","침대","수납","선반","조명", "꽃",
        "커튼","침구","이불","베개","주방용품","생활용품","인테리어",
        "향수", "로션", "뷰티", "샴푸", "린스", "치약", "크림", "물티슈",
        "세제", "화장지", "사료", "펫", "용품"
    ],

    "의료": [
        "약국","병원","치과","한의원","의원","클리닉","피부과","안과",
        "이비인후과","정형외과","산부인과","소아과","내과","비뇨기과",
        "재활의학과","정신건강의학과",
        "약","의약품","처방전","진료","검사","수술","치료",
        "비타민","영양제","오메가3","유산균","감기약","소화제",
        "진통제","해열제","연고","패치","한약","건강식품"
    ]
}